In [2]:
import pandas as pd

df = pd.DataFrame({
    
    'company' : ['google', 'google', 'facebook', 'ABC'],
    'job' : ['dev', 'manager', 'dev', 'executive'],
    'degree' : ['bachelor', 'master', 'bachelor', 'master'],
    'salary_mt_100K' : [0, 1, 1, 0]
})

df

    company        job    degree  salary_mt_100K
0    google        dev  bachelor               0
1    google    manager    master               1
2  facebook        dev  bachelor               1
3       ABC  executive    master               0

In [4]:
inputs = df.drop('salary_mt_100K', axis='columns')
target = df['salary_mt_100K']

target

0    0
1    1
2    1
3    0
Name: salary_mt_100K, dtype: int64

In [5]:
from sklearn.preprocessing import LabelEncoder

le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

# creating one more column 
inputs['company_n'] = le_company.fit_transform(
            inputs['company']
        )
inputs['job_n'] = le_company.fit_transform(
            inputs['job']
        )
inputs['degree_n'] = le_company.fit_transform(
            inputs['degree']
        )

In [7]:
inputs

    company        job    degree  company_n  job_n  degree_n
0    google        dev  bachelor          2      0         0
1    google    manager    master          2      2         1
2  facebook        dev  bachelor          1      0         0
3       ABC  executive    master          0      1         1

In [9]:
inputs_n = inputs.drop(['company', 'job', 'degree'], axis='columns')

inputs_n

   company_n  job_n  degree_n
0          2      0         0
1          2      2         1
2          1      0         0
3          0      1         1

In [11]:
from sklearn import tree

model = tree.DecisionTreeClassifier()

model.fit(inputs_n, target)

DecisionTreeClassifier()

In [13]:
model.score(inputs_n, target) # same dataset so 1.0

1.0

In [15]:
model.predict([[2, 2, 1]])

array([1])